nakhonthai/ESP32APRS_Audio/lib/LibAPRS_ESP32/AFSK.cpp

#include <Arduino.h>
#include "AFSK.h"
#include "esp_log.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_continuous.h"
#include <driver/timer.h>
#ifdef CONFIG_IDF_TARGET_ESP32
#include "hal/adc_hal.h"
#include "hal/adc_hal_common.h"
#endif
//#include "cppQueue.h"
#include "fir_filter.h"

#include "driver/sdm.h"
#include "driver/gptimer.h"

#include <hal/misc.h>
#include <soc/syscon_struct.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "driver/sigmadelta.h"

#include "driver/gptimer.h"

#include "esp_dsp.h"
#include <dsps_fir.h>
#ifdef CONFIG_IDF_TARGET_ESP32C3
#include <esp32c3/rom/crc.h>
#else
#include "esp32/rom/crc.h"
#endif

#include "modem.h"

#include "fx25.h"

extern "C"
{
#include "soc/syscon_reg.h"
#include "soc/syscon_struct.h"
}

#define DEBUG_TNC

// uint16_t bitrate = 1200;
// uint16_t sampleperbit = (SAMPLERATE / bitrate);
// uint8_t bit_sutuff_len = 5;
// uint8_t phase_bits = 32;
// uint8_t phase_inc = 4;
// uint16_t phase_max = (sampleperbit * phase_bits);
// uint16_t phase_threshold = (phase_max / 2);
// uint16_t mark_freq = 1200;
// uint16_t space_freq = 2200;
// uint32_t pll_inc = (1LLU << 32) / sampleperbit;

extern unsigned long custom_preamble;
extern unsigned long custom_tail;
int adcVal;

// bool input_HPF = false;
// bool input_BPF = false;

int8_t _sql_pin, _ptt_pin, _pwr_pin, _dac_pin, _adc_pin;
bool _sql_active, _ptt_active, _pwr_active;

uint8_t adc_atten;

static const adc_unit_t unit = ADC_UNIT_1;

void sample_dac_isr();
bool hw_afsk_dac_isr = false;

// static filter_t bpf;
// static filter_t lpf;
// static filter_t hpf;

// Afsk *AFSK_modem;
// extern Afsk modem;

static int Vref = 950;

#define FILTER_TAPS 8 // Number of taps in the FIR filter
uint16_t SAMPLERATE = 38400;
// Resampling configuration
#define INPUT_RATE 38400
#define OUTPUT_RATE 9600
uint16_t RESAMPLE_RATIO = (SAMPLERATE / OUTPUT_RATE); // 38400/9600 = 3
uint16_t BLOCK_SIZE = (SAMPLERATE / 50);              // Must be multiple of resample ratio
float *audio_buffer = NULL;

// AGC configuration
#define AGC_TARGET_RMS 0.2f // Target RMS level (-10dBFS)
#define AGC_ATTACK 0.02f    // Fast attack rate
#define AGC_RELEASE 0.001f  // Slow release rate
#define AGC_MAX_GAIN 10.0f
#define AGC_MIN_GAIN 0.1f

int8_t _led_rx_pin = 2;
int8_t _led_tx_pin = 4;
int8_t _led_strip_pin = -1;
uint8_t r_old = 0, g_old = 0, b_old = 0;
unsigned long rgbTimeout = 0;

#include <Adafruit_NeoPixel.h>
Adafruit_NeoPixel *strip;

extern float markFreq;  // mark frequency
extern float spaceFreq; // space freque
extern float baudRate;  // baudrate


/****************** Ring Buffer gen from DeepSeek *********************/
#define BUFFER_SIZE 1500
typedef struct {
    int16_t buffer[BUFFER_SIZE]; // Buffer to store int16_t data
    int head;                    // Index for the next write
    int tail;                    // Index for the next read
    int count;                   // Number of elements in the buffer
    bool lock;
} RingBuffer;

// Initialize the ring buffer
void RingBuffer_Init(RingBuffer *rb) {
    rb->head = 0;
    rb->tail = 0;
    rb->count = 0;
    rb->lock = false;
}

// Check if the buffer is full
bool RingBuffer_IsFull(const RingBuffer *rb) {
    return rb->count == BUFFER_SIZE;
}

// Check if the buffer is empty
bool RingBuffer_IsEmpty(const RingBuffer *rb) {
    return rb->count == 0;
}

// Add an element to the buffer (push)
bool RingBuffer_Push(RingBuffer *rb, int16_t data) {
    if (RingBuffer_IsFull(rb)) {
        return false; // Buffer is full
    }
    rb->lock = true;
    if(rb->head >= BUFFER_SIZE || rb->head < 0) rb->head = 0; // Check if head exceeds buffer size
    rb->buffer[rb->head] = data;
    rb->head = (rb->head + 1) % BUFFER_SIZE; // Wrap around using modulo
    rb->count++;
    rb->lock = false;
    return true;
}

// Remove an element from the buffer (pop)
bool RingBuffer_Pop(RingBuffer *rb, int16_t *data) {
    if (RingBuffer_IsEmpty(rb)) {
        return false; // Buffer is empty
    }
    int to=0;
    while(rb->lock) // Wait until the buffer is not locked
    {
      delay(1); // Avoid busy-waiting, adjust as needed
      if(to++ > 100) return false; // Timeout after 1 second
    }
    if(rb->tail >= BUFFER_SIZE || rb->tail < 0) rb->tail = 0; // Check if tail exceeds buffer size
    *data = rb->buffer[rb->tail];
    rb->tail = (rb->tail + 1) % BUFFER_SIZE; // Wrap around using modulo
    rb->count--;
    return true;
}

// Get the number of elements in the buffer
int RingBuffer_Size(const RingBuffer *rb) {
    return rb->count;
}

RingBuffer fifo; // Declare a ring buffer


/******************************************************************** */

// #define MARK_INC (uint16_t)(DIV_ROUND(SIN_LEN * (uint32_t)1200, CONFIG_AFSK_DAC_SAMPLERATE))
// #define SPACE_INC (uint16_t)(DIV_ROUND(SIN_LEN * (uint32_t)2200, CONFIG_AFSK_DAC_SAMPLERATE))

// #if defined(CONFIG_IDF_TARGET_ESP32S3)
// // #define USE_DSP
// #define BAUD_RATE 1200
// #define FILTER_ORDER 64
// // Filter contexts and buffers
// fir_f32_t firMark, firSpace;
// float markBuffer[BLOCK_SIZE];
// float spaceBuffer[BLOCK_SIZE];
// float delayMark[FILTER_ORDER + BLOCK_SIZE] = {0};
// float delaySpace[FILTER_ORDER + BLOCK_SIZE] = {0};

// // Cosine table indexed by unsigned byte.
// static float fcos256_table[256];

// #define fcos256(x) (fcos256_table[((x) >> 24) & 0xff])
// #define fsin256(x) (fcos256_table[(((x) >> 24) - 64) & 0xff])

// const float fir1200[] = {
//     0.00316367f, 0.00398861f, 0.00437723f, 0.00413208f, 0.00298872f, 0.00074047f, -0.00260284f, -0.00668306f, -0.01075057f, -0.01375085f, -0.01454411f, -0.01221729f, -0.00641016f, 0.00244106f, 0.01303073f, 0.02333366f, 0.03097455f, 0.03375193f, 0.03020101f, 0.02005505f, 0.00447537f, -0.01403413f, -0.03204008f, -0.04585163f, -0.05231281f, -0.04953725f, -0.03740889f, -0.01771846f, 0.00611527f, 0.02969454f, 0.04852908f, 0.05896765f, 0.05896765f, 0.04852908f, 0.02969454f, 0.00611527f, -0.01771846f, -0.03740889f, -0.04953725f, -0.05231281f, -0.04585163f, -0.03204008f, -0.01403413f, 0.00447537f, 0.02005505f, 0.03020101f, 0.03375193f, 0.03097455f, 0.02333366f, 0.01303073f, 0.00244106f, -0.00641016f, -0.01221729f, -0.01454411f, -0.01375085f, -0.01075057f, -0.00668306f, -0.00260284f, 0.00074047f, 0.00298872f, 0.00413208f, 0.00437723f, 0.00398861f, 0.00316367f};
// const float fir2200[] = {
//     0.00231442f, -0.00057143f, -0.00355072f, -0.00511464f, -0.00386876f, 0.00049756f, 0.00630273f, 0.01005055f, 0.00823119f, -0.00000000f, -0.01113572f, -0.01837338f, -0.01552207f, -0.00164028f, 0.01686771f, 0.02888214f, 0.02512596f, 0.00483548f, -0.02209390f, -0.03977362f, -0.03574035f, -0.00950762f, 0.02554950f, 0.04903640f, 0.04561719f, 0.01504976f, -0.02642793f, -0.05490854f, -0.05294572f, -0.02045258f, 0.02456674f, 0.05628144f, 0.05628144f, 0.02456674f, -0.02045258f, -0.05294572f, -0.05490854f, -0.02642793f, 0.01504976f, 0.04561719f, 0.04903640f, 0.02554950f, -0.00950762f, -0.03574035f, -0.03977362f, -0.02209390f, 0.00483548f, 0.02512596f, 0.02888214f, 0.01686771f, -0.00164028f, -0.01552207f, -0.01837338f, -0.01113572f, -0.00000000f, 0.00823119f, 0.01005055f, 0.00630273f, 0.00049756f, -0.00386876f, -0.00511464f, -0.00355072f, -0.00057143f, 0.00231442f};
// // Sample 9600Hz
// //  const float fir1200[] = {
// //  0.00207372f,0.00094242f,-0.00108431f,-0.00312228f,-0.00380735f,-0.00194212f,0.00239364f,0.00708630f,0.00861607f,0.00429478f,-0.00511124f,-0.01452088f,-0.01689924f,-0.00805945f,0.00918445f,0.02502154f,0.02797307f,0.01283878f,-0.01410570f,-0.03711208f,-0.04013115f,-0.01784123f,0.01901132f,0.04856762f,0.05104653f,0.02207739f,-0.02290384f,-0.05700372f,-0.05840175f,-0.02463269f,0.02493093f,0.06055125f,0.06055125f,0.02493093f,-0.02463269f,-0.05840175f,-0.05700372f,-0.02290384f,0.02207739f,0.05104653f,0.04856762f,0.01901132f,-0.01784123f,-0.04013115f,-0.03711208f,-0.01410570f,0.01283878f,0.02797307f,0.02502154f,0.00918445f,-0.00805945f,-0.01689924f,-0.01452088f,-0.00511124f,0.00429478f,0.00861607f,0.00708630f,0.00239364f,-0.00194212f,-0.00380735f,-0.00312228f,-0.00108431f,0.00094242f,0.00207372f
// //  };
// //  const float fir2200[] = {
// //  0.00043830f,0.00245964f,0.00018549f,-0.00331765f,-0.00132588f,0.00455582f,0.00347822f,-0.00577204f,-0.00701809f,0.00624079f,0.01198993f,-0.00505680f,-0.01795665f,0.00137868f,0.02397076f,0.00528852f,-0.02869738f,-0.01485215f,0.03067614f,0.02651018f,-0.02866679f,-0.03879992f,0.02199267f,0.04982518f,-0.01078912f,-0.05762045f,-0.00391802f,0.06057051f,0.02033804f,-0.05778330f,-0.03622740f,0.04932107f,0.04932107f,-0.03622740f,-0.05778330f,0.02033804f,0.06057051f,-0.00391802f,-0.05762045f,-0.01078912f,0.04982518f,0.02199267f,-0.03879992f,-0.02866679f,0.02651018f,0.03067614f,-0.01485215f,-0.02869738f,0.00528852f,0.02397076f,0.00137868f,-0.01795665f,-0.00505680f,0.01198993f,0.00624079f,-0.00701809f,-0.00577204f,0.00347822f,0.00455582f,-0.00132588f,-0.00331765f,0.00018549f,0.00245964f,0.00043830f
// //  };

