nakhonthai/ESP32APRS_Audio/lib/LibAPRS_ESP32/AFSK.cpp
  // portENTER_CRITICAL(&rtc_spinlock);
  // Configure pattern table, each 8 bit defines one channel
  //[7:4]-channel [3:2]-bit width [1:0]- attenuation
  // BIT WIDTH: 3: 12BIT  2: 11BIT  1: 10BIT  0: 9BIT
  // ATTEN: 3: ATTEN = 11dB 2: 6dB 1: 2.5dB 0: 0dB
  uint8_t val = (channel << 4) | (bits << 2) | (atten << 0);
  if (adc_unit & ADC_UNIT_1)
  {
    SYSCON.saradc_sar1_patt_tab[seq_num / 4] &= (~(0xff << ((3 - (seq_num % 4)) * 8)));
    SYSCON.saradc_sar1_patt_tab[seq_num / 4] |= (val << ((3 - (seq_num % 4)) * 8));
  }
  if (adc_unit & ADC_UNIT_2)
  {
    SYSCON.saradc_sar2_patt_tab[seq_num / 4] &= (~(0xff << ((3 - (seq_num % 4)) * 8)));
    SYSCON.saradc_sar2_patt_tab[seq_num / 4] |= (val << ((3 - (seq_num % 4)) * 8));
  }
  // portEXIT_CRITICAL(&rtc_spinlock);
  return ESP_OK;
}

void I2S_Init(i2s_mode_t MODE, i2s_bits_per_sample_t BPS)
{
  i2s_config_t i2s_config = {
      //.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_TX | I2S_MODE_DAC_BUILT_IN | I2S_MODE_ADC_BUILT_IN),
      .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_ADC_BUILT_IN),
      .sample_rate = SAMPLERATE,
      .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
      .channel_format = I2S_CHANNEL_FMT_ALL_LEFT,
      .communication_format = (i2s_comm_format_t)I2S_COMM_FORMAT_I2S_MSB,
      .intr_alloc_flags = 0, // ESP_INTR_FLAG_LEVEL1,
      .dma_buf_count = 5,
      .dma_buf_len = 768 * 2,
      //.tx_desc_auto_clear   = true,
      .use_apll = false // no Audio PLL ( I dont need the adc to be accurate )
  };

  // if (MODE == I2S_MODE_RX || MODE == I2S_MODE_TX)
  // {
  //   log_d("using I2S_MODE");
  //   i2s_pin_config_t pin_config;
  //   pin_config.bck_io_num = PIN_I2S_BCLK;
  //   pin_config.ws_io_num = PIN_I2S_LRC;
  //   if (MODE == I2S_MODE_RX)
  //   {
  //     pin_config.data_out_num = I2S_PIN_NO_CHANGE;
  //     pin_config.data_in_num = PIN_I2S_DIN;
  //   }
  //   else if (MODE == I2S_MODE_TX)
  //   {
  //     pin_config.data_out_num = PIN_I2S_DOUT;
  //     pin_config.data_in_num = I2S_PIN_NO_CHANGE;
  //   }

  //   i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL);
  //   i2s_set_pin(I2S_NUM_0, &pin_config);
  //   i2s_set_clk(I2S_NUM_0, SAMPLE_RATE, BPS, I2S_CHANNEL_MONO);
  // }
  // else if (MODE == I2S_MODE_DAC_BUILT_IN || MODE == I2S_MODE_ADC_BUILT_IN)
  // {
  log_d("Using I2S DAC/ADC_builtin");
  // install and start i2s driver
  if (i2s_driver_install(I2S_NUM_0, &i2s_config, 5, &i2s_event_queue) != ESP_OK)
  {
    log_d("ERROR: Unable to install I2S drives");
  }
  // GPIO36, VP
  // init ADC pad
  i2s_set_adc_mode(ADC_UNIT_1, ADC1_CHANNEL_0);
  // i2s_set_clk(I2S_NUM_0, SAMPLE_RATE, BPS, I2S_CHANNEL_MONO);
  i2s_adc_enable(I2S_NUM_0);
  delay(500); // required for stability of ADC

  // ***IMPORTANT*** enable continuous adc sampling
  SYSCON.saradc_ctrl2.meas_num_limit = 0;
  // sample time SAR setting
  SYSCON.saradc_ctrl.sar_clk_div = 2;
  SYSCON.saradc_fsm.sample_cycle = 2;
  adc_set_i2s_data_pattern(ADC_UNIT_1, 0, ADC_CHANNEL_0, ADC_WIDTH_BIT_12, cfg_adc_atten); // Input Vref 1.36V=4095,Offset 0.6324V=1744
  adc_set_i2s_data_len(ADC_UNIT_1, 1);

  i2s_set_pin(I2S_NUM_0, NULL);
  i2s_set_dac_mode(I2S_DAC_CHANNEL_LEFT_EN); // IO26
  i2s_zero_dma_buffer(I2S_NUM_0);
  // i2s_start(I2S_NUM_0);
  //  dac_output_enable(DAC_CHANNEL_1);
  // dac_output_enable(DAC_CHANNEL_2);
  // dac_i2s_enable();
  //}
}

void AFSK_TimerEnable(bool sts)
{
  if (sts == true)
  {
    i2s_adc_enable(I2S_NUM_0);
    adcEn = 0;
  }
  else
  {
    i2s_adc_disable(I2S_NUM_0);    
    adcEn = 0;
  }
}

#else

// static bool check_valid_data(const adc_digi_output_data_t *data);

// #define GET_UNIT(x) ((x >> 3) & 0x1)
// static uint16_t adc1_chan_mask = BIT(0);
// static uint16_t adc2_chan_mask = 0;
// static adc_channel_t channel[1] = {(adc_channel_t)ADC_CHANNEL_0};
static const char *TAG = "--(TAG ADC DMA)--";
#if defined(CONFIG_IDF_TARGET_ESP32)
#define ADC_OUTPUT_TYPE ADC_DIGI_OUTPUT_FORMAT_TYPE1
void IRAM_ATTR sample_adc_isr()
{
  if (!hw_afsk_dac_isr)
  {
    //portENTER_CRITICAL_ISR(&timerMux); // ISR start
    int16_t adc=analogReadMilliVolts(adc_pins[0]);
    RingBuffer_Push(&fifo, adc);
    //portEXIT_CRITICAL_ISR(&timerMux); // ISR end
  }
}
#else
#define ADC_OUTPUT_TYPE ADC_DIGI_OUTPUT_FORMAT_TYPE2
#endif

// Forward declerations
// int afsk_getchar(void);

// hw_timer_t *timer = NULL;



bool adcStopFlag = false;
void AFSK_TimerEnable(bool sts)
{
  // if (xSemaphoreTake(xI2CSemaphore, (TickType_t)DEFAULT_SEMAPHORE_TIMEOUT) == pdTRUE)
  // {
  // vTaskSuspendAll ();
  //adcq.flush();
  if (sts == true)
  {
    //   timerAlarmEnable(timer);
    if (AdcHandle != NULL)
    {
      adc_continuous_start(AdcHandle);
      //HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 1);
    }
    adcEn = 0;
  }
  else
  {

    //   timerAlarmDisable(timer);
    if (AdcHandle != NULL)
    {      
      //log_d("SAR DIV=%d LEN=%d", SYSCON.saradc_ctrl.sar_clk_div, SYSCON.saradc_ctrl.sar1_patt_len);
      //HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 0);
      //SYSCON.saradc_ctrl.sar1_patt_p_clear = 1;
      adc_continuous_stop(AdcHandle);
      // adcStopFlag = true;
    }
    adcEn = 0;
  }
  // xTaskResumeAll ();
  // }
}
#endif

hw_timer_t *timer_dac = NULL;
hw_timer_t *timer_adc = NULL;

SemaphoreHandle_t xI2CSemaphore;

#define DEFAULT_SEMAPHORE_TIMEOUT 10

portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;

void DAC_TimerEnable(bool sts)
{
  if (timer_dac == NULL)
    return;
  portENTER_CRITICAL_ISR(&timerMux);
  if (sts == true)
  {
    timerStart(timer_dac);
  }
  else
  {
    timerStop(timer_dac);
  }
  portEXIT_CRITICAL_ISR(&timerMux);
  dacEn = 0;
}

bool getTransmit()
{
  bool ret = false;
  if ((digitalRead(_ptt_pin) ^ _ptt_active) == 0) // signal active with ptt_active
    ret = true;
  else
    ret = false;
  if (hw_afsk_dac_isr)
    ret = true;
  return ret;
}

void setTransmit(bool val)
{
  hw_afsk_dac_isr = val;
}

bool getReceive()
{
  bool ret = false;
  if ((digitalRead(_ptt_pin) ^ _ptt_active) == 0) // signal active with ptt_active
    return false;                                 // PTT Protection receive
  if (digitalRead(LED_RX_PIN))                    // Check RX LED receiving.
    ret = true;
  return ret;
}

/**
 * @brief Controls PTT output
 * @param state False - PTT off, true - PTT on
 */
void setPtt(bool state)
{
  if (state)
  {
    setTransmit(true);
    if (_ptt_pin > 34)
      _ptt_pin = 32;
    if (_ptt_active)
    {
      pinMode(_ptt_pin, OUTPUT);
      digitalWrite(_ptt_pin, HIGH);
    }
    else
    { // Open Collector to LOW
      pinMode(_ptt_pin, OUTPUT_OPEN_DRAIN);
      digitalWrite(_ptt_pin, LOW);
    }
    LED_Status(255, 0, 0);
  }
  else
  {
    setTransmit(false);
    //adcq.flush();
    if (_ptt_active)
    {
      pinMode(_ptt_pin, OUTPUT);
      digitalWrite(_ptt_pin, LOW);
    }
    else
    { // Open Collector to HIGH
      pinMode(_ptt_pin, OUTPUT_OPEN_DRAIN);
      digitalWrite(_ptt_pin, HIGH);
    }
    LED_Status(0, 0, 0);
  }
}

uint8_t modem_config = 0;
void afskSetModem(uint8_t val, bool bpf,uint16_t timeSlot,uint16_t preamble,uint8_t fx25Mode)
{
  if (bpf)
    ModemConfig.flatAudioIn = 1;
  else
    ModemConfig.flatAudioIn = 0;

  if (val == 0)
  {
    ModemConfig.modem = MODEM_300;
#if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
    SAMPLERATE = 9600;
#elif defined(CONFIG_IDF_TARGET_ESP32)
    SAMPLERATE = 19200;
#else
    SAMPLERATE = 38400;
#endif
    BLOCK_SIZE = (SAMPLERATE / 50); // Must be multiple of resample ratio
    RESAMPLE_RATIO = (SAMPLERATE / 9600);
  }
  else if (val == 1)
  {
    ModemConfig.modem = MODEM_1200;
#if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
    SAMPLERATE = 9600;
#elif defined(CONFIG_IDF_TARGET_ESP32)
    SAMPLERATE = 28800;
#else
    SAMPLERATE = 38400;
#endif
    BLOCK_SIZE = (SAMPLERATE / 50); // Must be multiple of resample ratio
    RESAMPLE_RATIO = (SAMPLERATE / 9600);
  }
  else if (val == 2)
  {
    ModemConfig.modem = MODEM_1200_V23;
#if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
    SAMPLERATE = 9600;
#elif defined(CONFIG_IDF_TARGET_ESP32)
    SAMPLERATE = 28800;
#else
    SAMPLERATE = 38400;
#endif
    BLOCK_SIZE = (SAMPLERATE / 50); // Must be multiple of resample ratio
    RESAMPLE_RATIO = (SAMPLERATE / 9600);
  }
  else if (val == 3)
  {
    ModemConfig.modem = MODEM_9600;
    SAMPLERATE = 38400;
    BLOCK_SIZE = (SAMPLERATE / 100); // Must be multiple of resample ratio
    RESAMPLE_RATIO = (SAMPLERATE / 38400);
  }
  if (audio_buffer != NULL)
  {
    free(audio_buffer);
    audio_buffer = NULL;
  }
  audio_buffer = (float *)calloc(BLOCK_SIZE, sizeof(float));
  if (audio_buffer == NULL)
  {
    log_d("Error allocating memory for audio buffer");
    return;
  }
  log_d("Modem: %d, SampleRate: %d, BlockSize: %d", ModemConfig.modem, SAMPLERATE, BLOCK_SIZE);
  ModemConfig.usePWM = 1;
  ModemInit();
  Ax25Init(fx25Mode);
  if(fx25Mode>0) Fx25Init();
  Ax25TimeSlot(timeSlot);
  Ax25TxDelay(preamble);
}

void afskSetHPF(bool val)
{
  // input_HPF = val;
}
void afskSetBPF(bool val)
{
  // input_BPF = val;
}
void afskSetSQL(int8_t val, bool act)
{
  _sql_pin = val;
  _sql_active = act;
}
void afskSetPTT(int8_t val, bool act)
{
  _ptt_pin = val;
  _ptt_active = act;
}
void afskSetPWR(int8_t val, bool act)
{
  _pwr_pin = val;
  _pwr_active = act;
}

//uint32_t ret_num;
//uint8_t *resultADC;

typedef struct
{
  voidFuncPtr fn;
  void *arg;
} interrupt_config_t;

// portMUX_TYPE DRAM_ATTR timerMux = portMUX_INITIALIZER_UNLOCKED;
volatile SemaphoreHandle_t timerSemaphore;

