nakhonthai/ESP32APRS_Audio/lib/LibAPRS_ESP32/AFSK.cpp
#ifndef I2S_INTERNAL
int16_t adcPush;
//static TaskHandle_t s_task_handle;
// adc_oneshot_unit_handle_t adc1_handle;
static bool s_conv_done_cb(adc_continuous_handle_t stAdcHandle, const adc_continuous_evt_data_t *edata, void *user_data)
{
  //BaseType_t mustYield = pdFALSE;
  //Notify that ADC continuous driver has done enough number of conversions
  //vTaskNotifyGiveFromISR(s_task_handle, &mustYield);
  //portENTER_CRITICAL_ISR(&timerMux);
  fifo.lock = true;
  for (uint32_t k = 0; k < edata->size; k += SOC_ADC_DIGI_RESULT_BYTES)
  {
    adc_digi_output_data_t *p = (adc_digi_output_data_t *)&edata->conv_frame_buffer[k];

#if defined(CONFIG_IDF_TARGET_ESP32)
    if (p->type1.channel > 0)
      continue;
    adcPush = (int16_t)p->type1.data;
#else
    if ((p->type2.channel > 0) || (p->type2.unit > 0))
      continue;
    adcPush = (int)p->type2.data;
#endif

    if(fifo.head >= BUFFER_SIZE || fifo.head < 0) fifo.head = 0; // Check if head exceeds buffer size
    fifo.buffer[fifo.head] = adcPush;
    fifo.head = (fifo.head + 1) % BUFFER_SIZE; // Wrap around using modulo
    fifo.count++;    
//RingBuffer_Push(&fifo, adcPush);
  }  
  fifo.lock = false;
  //portEXIT_CRITICAL_ISR(&timerMux);
  // vTaskDelay(TMP102_UPDATE_CICLE_MS / portTICK_PERIOD_MS);
  //return (mustYield == pdTRUE);
  return true;
}
// static TaskHandle_t s_task_handle;
// static bool IRAM_ATTR s_conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *user_data)
// {
//     BaseType_t mustYield = pdFALSE;
//     //Notify that ADC continuous driver has done enough number of conversions
//     vTaskNotifyGiveFromISR(s_task_handle, &mustYield);

//     return (mustYield == pdTRUE);
// }

void adc_continue_init(void)
{
  adc_channel_t channel;
  adc_unit_t adc_unit = ADC_UNIT_1;
  esp_err_t Err = adc_continuous_io_to_channel(adc_pins[0], &adc_unit, &channel);
  if (Err != ESP_OK)
  {
    log_e("Pin %u is not ADC pin!", adc_pins[0]);
  }
  if (adc_unit != 0)
  {
    log_e("Only ADC1 pins are supported in continuous mode!");
  }

  uint32_t conv_frame_size = (uint32_t)(BLOCK_SIZE * SOC_ADC_DIGI_RESULT_BYTES);
  // uint32_t conv_frame_size = ADC_SAMPLES_COUNT;
  /* On initialise l'ADC : */
  adc_continuous_handle_cfg_t AdcHandleConfig = {
      .max_store_buf_size = (uint32_t)conv_frame_size * 2,
      .conv_frame_size = (uint32_t)conv_frame_size,
  };
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
  AdcHandleConfig.flags.flush_pool  = true;
  #endif  
  Err = adc_continuous_new_handle(&AdcHandleConfig, &AdcHandle);
  if (Err != ESP_OK)
    log_d("AdMeasure : Adc Continuous Init Failed.");
  else
  {
    /* On configure l'ADC : */
    adc_continuous_config_t AdcConfig = {
#if defined(CONFIG_IDF_TARGET_ESP32)
        .sample_freq_hz = (uint32_t)(SAMPLERATE * 11 / 9),
#else
        .sample_freq_hz = (uint32_t)(SAMPLERATE),
#endif
        .conv_mode = ADC_CONV_SINGLE_UNIT_1, // On utilise uniquement l'ADC1.
        .format = ADC_OUTPUT_TYPE,           // On utilise le type 2. Pris dans l'exemple.
    };
    log_d("ADC Continuous Configuration Done. SAMPLERATE: %d Hz", AdcConfig.sample_freq_hz);

    adc_digi_pattern_config_t adc_pattern[SOC_ADC_PATT_LEN_MAX] = {0};
    AdcConfig.pattern_num = 1;
    // for (int ii = 0; ii < NBR_CHANNELS; ii++)
    //{
    // uint8_t unit = ADC_UNIT_1;
    // uint8_t ch = channel & 0x7;
    adc_pattern[0].atten = cfg_adc_atten;
    adc_pattern[0].channel = channel;
    adc_pattern[0].unit = ADC_UNIT_1;
    adc_pattern[0].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH;
    //}
    AdcConfig.adc_pattern = adc_pattern;
    Err = adc_continuous_config(AdcHandle, &AdcConfig);
    if (Err != ESP_OK)
      ESP_LOGI(TAG, "=====> AdMeasure : Adc Continuous Configuration Failed.");
    else
    {
      // Setup callbacks for complete event
      adc_continuous_evt_cbs_t cbs = {
          .on_conv_done = s_conv_done_cb,
          //.on_pool_ovf can be used in future
      };
      // adc_handle[adc_unit].adc_interrupt_handle.fn = (voidFuncPtr)userFunc;
      Err = adc_continuous_register_event_callbacks(AdcHandle, &cbs, NULL);
      if (Err != ESP_OK)
      {
        log_e("adc_continuous_register_event_callbacks failed!");
      }

      // Attach the pins to the ADC unit
#ifdef ARDUINO_TEST
      for (int i = 0; i < cfg.channels; i++)
      {
        adc_channel = cfg.adc_channels[i];
        adc_continuous_channel_to_io(ADC_UNIT, adc_channel, &io_pin);
        // perimanSetPinBus: uint8_t pin, peripheral_bus_type_t type, void * bus, int8_t bus_num, int8_t bus_channel
        if (!perimanSetPinBus(io_pin, ESP32_BUS_TYPE_ADC_CONT, (void *)(ADC_UNIT + 1), ADC_UNIT, adc_channel))
        {
          LOGE("perimanSetPinBus to Continuous an ADC Unit %u failed!", ADC_UNIT);
          return false;
        }
      }
#endif

// adc_cali_line_fitting_config_t cali_config = {
//       .unit_id = ADC_UNIT_1,
//       .bitwidth = ADC_BITWIDTH_12,
//       .atten = ADC_ATTEN_DB_0,
//     };

// adc_continuous_start(AdcHandle);

// adc_cali_line_fitting_config_t cali_config = {
//     .unit_id = ADC_UNIT_1,
//     .atten = ADC_ATTEN_DB_0,
//     .bitwidth = ADC_BITWIDTH_12,
// };
// log_d("Creating ADC_UNIT_%d line cali handle", 1);
// Err = adc_cali_create_scheme_line_fitting(&cali_config, &AdcCaliHandle);
// // Err = adc_cali_create_scheme_curve_fitting(&Curve_Fitting, &AdcCaliHandle);
// if (Err != ESP_OK)
//   ESP_LOGI(TAG, "=====> AdMeasure : Fail to create the Curve Fitting Scheme.");
// else
// {
//   /* On démarre l'ADC : */
//   //SYSCON.saradc_ctrl2.meas_num_limit = 0;
//   adc_continuous_start(AdcHandle);
//   //adc_continuous_stop(AdcHandle);
//   //SYSCON.saradc_ctrl2.meas_num_limit = 0;
//   //HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 0);
//   log_d("ADC Continuous has been start");
// }
/* Mise en place de la calibration permettant d'avoir les résultats en mV directement :
 * On utilise le schéma de calibration de type Courbe (Le seul proposé par la puce). */
#ifdef CONFIG_IDF_TARGET_ESP32
      adc_cali_line_fitting_config_t cali_config = {
#else
      adc_cali_curve_fitting_config_t cali_config = {
#endif
        .unit_id = ADC_UNIT_1,
        .atten = cfg_adc_atten,
        .bitwidth = ADC_BITWIDTH_12,
      };

