nakhonthai/ESP32APRS_Audio/lib/LibAPRS_ESP32/AFSK.cpp
#ifdef CONFIG_IDF_TARGET_ESP32
      Err = adc_cali_create_scheme_line_fitting(&cali_config, &AdcCaliHandle);
      log_d("Creating ADC_UNIT_%d line cali handle", 1);
//
#else
      Err = adc_cali_create_scheme_curve_fitting(&cali_config, &AdcCaliHandle);
      log_d("Creating ADC_UNIT_%d cerve cali handle", 1);
//
#endif
 
      //s_task_handle = xTaskGetCurrentTaskHandle();

      if (Err != ESP_OK)
        ESP_LOGI(TAG, "=====> AdMeasure : Fail to create the Curve Fitting Scheme.");
      else
      {
        //if(_sql_pin < 0){
          /* On démarre l'ADC : */
          // SYSCON.saradc_ctrl2.meas_num_limit = 0;
          adc_continuous_start(AdcHandle);
          // adc_continuous_stop(AdcHandle);
          // SYSCON.saradc_ctrl2.meas_num_limit = 0;
          // HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 0);
          log_d("ADC Continuous has been start");
          adcStopFlag = false;

                 // }else{
        //   adc_continuous_stop(AdcHandle);
        //   adcStopFlag = true; // Stop ADC if SQL pin is set
        // }
      }
    }
  }
}
#endif

/*
 * Configure and initialize the sigma delta modulation
 * on channel 0 to output signal on GPIO4
 */
static void sigmadelta_init(void)
{
  sigmadelta_config_t sigmadelta_cfg = {
      .channel = SIGMADELTA_CHANNEL_0,
      .sigmadelta_duty = 127,
      .sigmadelta_prescale = 96,
      #ifdef CONFIG_IDF_TARGET_ESP32C3
      .sigmadelta_gpio = GPIO_NUM_1, // GPIO1 is used for ESP32C3
      #else 
      .sigmadelta_gpio = GPIO_NUM_26,
      #endif
  };
  sigmadelta_config(&sigmadelta_cfg);
}

void AFSK_hw_init(void)
{
  // Set up ADC
  if (_sql_pin > -1)
    pinMode(_sql_pin, INPUT_PULLUP);
  if (_pwr_pin > -1)
    pinMode(_pwr_pin, OUTPUT);
  if (_led_tx_pin > -1)
  {
    pinMode(_led_tx_pin, OUTPUT);
  }
  if (_led_rx_pin > -1)
  {
    pinMode(_led_rx_pin, OUTPUT);
  }
  if(_led_strip_pin > -1)
  {
    strip = new Adafruit_NeoPixel(1, _led_strip_pin, NEO_GRB + NEO_KHZ800);
  }

  if (_pwr_pin > -1)
    digitalWrite(_pwr_pin, !_pwr_active);

    RingBuffer_Init(&fifo);

#ifdef I2S_INTERNAL
  //  Initialize the I2S peripheral
  I2S_Init(I2S_MODE_DAC_BUILT_IN, I2S_BITS_PER_SAMPLE_16BIT);
#else

adc_continue_init();

// Initialize FIR filter
// resample_fir.coeffs = (float *)resample_coeffs;
// resample_fir.delay = filter_state;
// resample_fir.N = FILTER_TAPS;
// resample_fir.pos = 0;

// pinMode(MIC_PIN, INPUT);
//  Init ADC and Characteristics
//  esp_adc_cal_characteristics_t characteristics;
//  adc1_config_width(ADC_WIDTH_BIT_12);
//  adc1_config_channel_atten(SPK_PIN, cfg_adc_atten); // Input 1.24Vp-p,Use R 33K-(10K//10K) divider input power 1.2Vref
//  esp_adc_cal_characterize(ADC_UNIT_1, cfg_adc_atten, ADC_WIDTH_BIT_12, 0, &adc1_chars);

// adc1_config_channel_atten(SPK_PIN, ADC_ATTEN_DB_11); //Input 3.3Vp-p,Use R 10K divider input power 3.3V
// esp_adc_cal_get_characteristics(V_REF, ADC_ATTEN_DB_11, ADC_WIDTH_BIT_12, &characteristics);
// log_d("v_ref routed to 3.3V\n");
#endif

  sigmadelta_init();

  // Create semaphore to inform us when the timer has fired
  timerSemaphore = xSemaphoreCreateBinary();
  // Set timer frequency to 20Mhz
  timer_dac = timerBegin(20000000);
  // Attach onTimer function to our timer.
  timerAttachInterrupt(timer_dac, &sample_dac_isr); // Attaches the handler function to the timer
  // Set alarm to call onTimer function every second (value in microseconds).
  // Repeat the alarm (third parameter) with unlimited count = 0 (fourth parameter).
  timerAlarm(timer_dac, (uint64_t)20000000 / CONFIG_AFSK_DAC_SAMPLERATE, true, 0);
  timerStop(timer_dac);


  //   ESP_LOGI(TAG, "Create timer handle");
  //   gptimer_handle_t gptimer = NULL;
  //   gptimer_config_t timer_config = {
  //       .clk_src = GPTIMER_CLK_SRC_DEFAULT,
  //       .direction = GPTIMER_COUNT_UP,
  //       .resolution_hz = 8000000, // 1MHz, 1 tick=1us
  //   };
  //   ESP_ERROR_CHECK(gptimer_new_timer(&timer_config, &gptimer));

  //   gptimer_event_callbacks_t cbs = {
  //       .on_alarm = example_timer_on_alarm_cb,
  //   };
  //   ESP_ERROR_CHECK(gptimer_register_event_callbacks(gptimer, &cbs, queue));

  //   ESP_LOGI(TAG, "Enable timer");
  //   ESP_ERROR_CHECK(gptimer_enable(gptimer));

  //   ESP_LOGI(TAG, "Start timer, stop it at alarm event");
  //   gptimer_alarm_config_t alarm_config1 = {
  //       .alarm_count = (uint64_t)8000000/ SAMPLERATE, // period = 1s
  //   };
  //   alarm_config1.flags.auto_reload_on_alarm = true;
  //   alarm_config1.reload_count = 0;
  //   ESP_ERROR_CHECK(gptimer_set_alarm_action(gptimer, &alarm_config1));
  //   ESP_ERROR_CHECK(gptimer_start(gptimer));
  // if (xQueueReceive(queue, &ele, pdMS_TO_TICKS(2000))) {
  //     ESP_LOGI(TAG, "Timer stopped, count=%llu", ele.event_count);
  // } else {
  //     ESP_LOGW(TAG, "Missed one count event");
  // }

  setTransmit(false);
}

void AFSK_init(int8_t adc_pin, int8_t dac_pin, int8_t ptt_pin, int8_t sql_pin, int8_t pwr_pin, int8_t led_tx_pin, int8_t led_rx_pin, int8_t led_strip_pin,bool ptt_act,bool sql_act,bool pwr_act)
{
  _adc_pin = adc_pin;
  _dac_pin = dac_pin;
  _ptt_pin = ptt_pin;
  _sql_pin = sql_pin;
  _pwr_pin = pwr_pin;
  _led_tx_pin = led_tx_pin;
  _led_rx_pin = led_rx_pin;
  _led_strip_pin = led_strip_pin;

  _ptt_active = ptt_act;
  _sql_active = sql_act;
  _pwr_active = pwr_act;

  if (xI2CSemaphore == NULL)
  {
    xI2CSemaphore = xSemaphoreCreateMutex();
    if ((xI2CSemaphore) != NULL)
      xSemaphoreGive((xI2CSemaphore));
  }

  tcb_t *tp = &tcb;
  int i = 0;
  tp->port = i;
  tp->kiss_type = i << 4;
  tp->avg = 2048;
  tp->cdt = false;
  tp->cdt_lvl = 0;
  tp->cdt_led_pin = 2;
  tp->cdt_led_on = 2;
  log_d("cdt_led_pin = %d, cdt_led_on = %d, port = %d", tp->cdt_led_pin, tp->cdt_led_on, tp->port);
  // tp->ptt_pin = 12;
  #ifdef FX25TNCR2
  tp->sta_led_pin = STA_LED_PIN[i];
#endif

#ifdef FX25_ENABLE
  tp->fx25_parity = FX25_PARITY[i]; // FX.25 parity
#endif
  tp->cdt_sem = xSemaphoreCreateBinary();
  assert(tp->cdt_sem);
  assert(xSemaphoreGive(tp->cdt_sem) == pdTRUE); // initialize

