nakhonthai/ESP32APRS_Audio/lib/LibAPRS_ESP32/AFSK.cpp
  // KISS default parameter
  // tp->fullDuplex = kiss_fullduplex[i]; // half duplex
  tp->fullDuplex = true;  // full duplex
  tp->SlotTime = 10;      // 100ms
  tp->TXDELAY = 50;       // 500ms
  tp->persistence_P = 63; // P = 0.25
  AFSK_hw_init();
}

int offset = 0;
int dc_offset = 620;
// void afskSetDCOffset(int val)
// {
//   dc_offset = offset = val;
// }

// bool dac_push(uint8_t data)
// {
//   if (dacq.isFull())
//   {
//     delay(5);
//   }
//   dacq.push(&data);
//   return true;
// }

bool sqlActive = false;

// #ifndef I2S_INTERNAL
//  int x=0;

uint8_t sinwave = 127;

bool adcq_lock = false;

uint16_t phaseAcc = 0;

void IRAM_ATTR sample_dac_isr()
{
  if (hw_afsk_dac_isr)
  {
    portENTER_CRITICAL_ISR(&timerMux); // ISR start
    sinwave = MODEM_BAUDRATE_TIMER_HANDLER();
    // Sigma-delta duty of one channel, the value ranges from -128 to 127, recommended range is -90 ~ 90.The waveform is more like a random one in this range.
    int8_t sine = (int8_t)(((sinwave - 127) * 12) >> 4); // Redue sine = -85 ~ 85
    sigmadelta_set_duty(SIGMADELTA_CHANNEL_0, sine);
    portEXIT_CRITICAL_ISR(&timerMux); // ISR end
    // Give a semaphore that we can check in the loop
    // xSemaphoreGiveFromISR(timerSemaphore, NULL);
  }
}

extern int mVrms;
extern float dBV;

long mVsum = 0;
int mVsumCount = 0;
uint8_t dcd_cnt = 0;
bool sqlActiveOld = false;
#define READ_LEN 256
//uint32_t ret_num = 0;
//uint8_t resultADC[READ_LEN] = {0};

void AFSK_Poll(bool SA818, bool RFPower)
{

  int mV;
  int x = 0;
  int16_t adc = 0;
  // uint8_t sintable[8] = {127, 217, 254, 217, 127, 36, 0, 36};
#ifdef I2S_INTERNAL
  size_t bytesRead;
  uint16_t pcm_in[ADC_SAMPLES_COUNT];
  uint16_t pcm_out[ADC_SAMPLES_COUNT];
#endif

  if (_sql_pin > -1)
  {                                                 // Set SQL pin active
    if ((digitalRead(_sql_pin) ^ _sql_active) == 0){ // signal active with sql_active
      sqlActive = true;
      // if(sqlActiveOld == false){
      //   AFSK_TimerEnable(true); // Start ADC if SQL pin is set
      // }    
    } else {
      sqlActive = false;
      // if(sqlActiveOld == true){
      //     AFSK_TimerEnable(false); // Stop ADC if SQL pin is not set
      // }
    }
  }
  else
  {
    sqlActive = true;
  }
  sqlActiveOld = sqlActive;

  if (hw_afsk_dac_isr)
  {

    // #ifdef I2S_INTERNAL
    //     memset(pcm_out, 0, sizeof(pcm_out));
    //     for (x = 0; x < ADC_SAMPLES_COUNT; x++)
    //     {
    //       // LED_RX_ON();
    //       adcVal = (int)AFSK_dac_isr(AFSK_modem);
    //       //  log_d(adcVal,HEX);
    //       //  log_d(",");
    //       if (AFSK_modem->sending == false && adcVal == 0)
    //         break;

    //       // float adcF = hp_filter.Update((float)adcVal);
    //       // adcVal = (int)adcF;
    //       // ไม่สามารถใช้งานในโหมด MONO ได้ จะต้องส่งข้อมูลตามลำดับซ้ายและขวา เอาต์พุต DAC บน I2S เป็นสเตอริโอเสมอ
    //       //  Ref: https://lang-ship.com/blog/work/esp32-i2s-dac/#toc6
    //       //  Left Channel GPIO 26
    //       pcm_out[x] = (uint16_t)adcVal; // MSB
    //       if (SA818)
    //       {
    //         pcm_out[x] <<= 7;
    //         pcm_out[x] += 10000;
    //       }
    //       else
    //       {
    //         pcm_out[x] <<= 8;
    //       }
    //       x++;
    //       // Right Channel GPIO 25
    //       pcm_out[x] = 0;
    //     }

    //     // size_t writeByte;
    //     if (x > 0)
    //     {

    //       // if (i2s_write_bytes(I2S_NUM_0, (char *)&pcm_out, (x * sizeof(uint16_t)), portMAX_DELAY) == ESP_OK)
    //       size_t writeByte;
    //       if (i2s_write(I2S_NUM_0, (char *)&pcm_out, (x * sizeof(uint16_t)), &writeByte, portMAX_DELAY) != ESP_OK)
    //       {
    //         log_d("I2S Write Error");
    //       }
    //     }
    //     // size_t writeByte;
    //     // int availableBytes = x * sizeof(uint16_t);
    //     // int buffer_position = 0;
    //     // size_t bytesWritten = 0;
    //     // if (x > 0)
    //     // {
    //     //   do
    //     //   {

    //     //     // do we have something to write?
    //     //     if (availableBytes > 0)
    //     //     {
    //     //       // write data to the i2s peripheral
    //     //       i2s_write(I2S_NUM_0, buffer_position + (char *)&pcm_out,availableBytes, &bytesWritten, portMAX_DELAY);
    //     //       availableBytes -= bytesWritten;
    //     //       buffer_position += bytesWritten;
    //     //     }
    //     //     delay(bytesWritten);
    //     //   } while (bytesWritten > 0);
    //     // }

    //     // รอให้ I2S DAC ส่งให้หมดบัพเฟอร์ก่อนสั่งปิด DAC/PTT
    //     if (AFSK_modem->sending == false)
    //     {
    //       int txEvents = 0;
    //       memset(pcm_out, 0, sizeof(pcm_out));
    //       // log_d("TX TAIL");
    //       //  Clear Delay DMA Buffer
    //       size_t writeByte;
    //       for (int i = 0; i < 5; i++)
    //         i2s_write(I2S_NUM_0, (char *)&pcm_out, (ADC_SAMPLES_COUNT * sizeof(uint16_t)), &writeByte, portMAX_DELAY);
    //       // i2s_write_bytes(I2S_NUM_0, (char *)&pcm_out, (ADC_SAMPLES_COUNT * sizeof(uint16_t)), portMAX_DELAY);
    //       // wait on I2S event queue until a TX_DONE is found
    //       while (xQueueReceive(i2s_event_queue, &i2s_evt, portMAX_DELAY) == pdPASS)
    //       {
    //         if (i2s_evt.type == I2S_EVENT_TX_DONE) // I2S DMA finish sent 1 buffer
    //         {
    //           if (++txEvents > 6)
    //           {
    //             // log_d("TX DONE");
    //             break;
    //           }
    //           delay(10);
    //         }
    //       }
    //       dac_i2s_disable();
    //       i2s_zero_dma_buffer(I2S_NUM_0);
    //       // i2s_adc_enable(I2S_NUM_0);
    //       digitalWrite(_pwr_pin, !_pwr_active);
    //       digitalWrite(_ptt_pin, !_ptt_active);
    //     }
    // #endif
  }
  else
  {
    
    if (audio_buffer != NULL)
    {
      tcb_t *tp = &tcb;
#ifdef I2S_INTERNAL
      // log_d("RX Signal");
      sqlActive = false;

      if (i2s_read(I2S_NUM_0, (char *)&pcm_in, (BLOCK_SIZE * sizeof(uint16_t)), &bytesRead, portMAX_DELAY) == ESP_OK)
      {
        x = 0;
        digitalWrite(4, HIGH);
        mVsum = 0;
        mVsumCount = 0;
        // log_d("%i,%i,%i,%i", pcm_in[0], pcm_in[1], pcm_in[2], pcm_in[3]);
        for (int i = 0; i < (bytesRead / sizeof(uint16_t)); i += 2)
        {
          /* Converts Raw ADC Reading To Calibrated Value & Return the results in mV */
          // adc_cali_raw_to_voltage()
          // adcVal = (int)esp_adc_cal_raw_to_voltage((int)pcm_in[i], &adc1_chars); //Read ADC
          adc = (int)pcm_in[i];
          x++;
#else
// ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
// size_t resNum = BLOCK_SIZE * SOC_ADC_DIGI_RESULT_BYTES;
//       uint8_t *resultADC = (uint8_t *)malloc(resNum);
//       if(resultADC){
//        esp_err_t ret = adc_continuous_read(AdcHandle, resultADC, resNum, &ret_num, 0);
//             if (ret == ESP_OK) {
//                 for (int i = 0; i < ret_num; i += SOC_ADC_DIGI_RESULT_BYTES) {
//                   adc_digi_output_data_t *p = (adc_digi_output_data_t*)&resultADC[i];
//                   #if defined(CONFIG_IDF_TARGET_ESP32)
//                       if (p->type1.channel > 0)
//                         continue;
//                       adcPush = (int16_t)p->type1.data;
//                   #else
//                       if ((p->type2.channel > 0) || (p->type2.unit > 0))
//                         continue;
//                       adcPush = (int)p->type2.data;
//                   #endif
//                   RingBuffer_Push(&fifo, adcPush);
//                 }
//               }
//               free(resultADC);
//       }
      //while (adcq.getCount() >= BLOCK_SIZE)
      while(RingBuffer_Size(&fifo) >= BLOCK_SIZE)
      {
        //digitalWrite(4, HIGH);
        
        mVsum = 0;
        mVsumCount = 0;
        //portENTER_CRITICAL_ISR(&timerMux);
        for (x = 0; x < BLOCK_SIZE; x++)
        {
          // while(adcq_lock) delay(1);
          //if (!adcq.pop(&adc)) // Pull queue buffer
          
